/* No comment provided by engineer. */
"Could not move to Applications folder" = "לא ניתן היה להעביר אל תיקיית היישומים";

/* No comment provided by engineer. */
"Do Not Move" = "אל תעביר";

/* No comment provided by engineer. */
"I can move myself to the Applications folder if you'd like." = "אני יכול להזיז את עצמי לתיקיית היישומים אם תרצה.";

/* No comment provided by engineer. */
"Move to Applications Folder" = "העבר לתיקיית היישומים";

/* No comment provided by engineer. */
"Move to Applications folder in your Home folder?" = "האם להעביר לתיקיית היישומים בתיקיית הבית שלך?";

/* No comment provided by engineer. */
"Move to Applications folder?" = "האם להעביר לתיקיית היישומים?";

/* No comment provided by engineer. */
"Note that this will require an administrator password." = "שים לב שפעולה זו מצריכה את סיסמת מנהל המחשב.";

/* No comment provided by engineer. */
"This will keep your Downloads folder uncluttered." = "פעולה זו תשאיר את תיקיית ההורדות שלך מסודרת.";

